utils/load_test.yaml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 10
      arrivalRate: 5
    - duration: 10
      arrivalCount: 20
  defaults:
    headers:
      Authorization: 'Basic YWRtaW46cGFzc3dvcmQ='

scenarios:
  - name: "Health Check"
    flow:
    - get:
        url: "/health"
  - name: "Items"
    flow:
    - get:
        url: "/items"